GopalSaraf/Practicals/PSDL/include/proc/pic12f519.h
// Register: FSR
#define FSR FSR
extern volatile unsigned char           FSR                 __at(0x004);
#ifndef _LIB_BUILD
asm("FSR equ 04h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR                    :8;
    };
} FSRbits_t;
extern volatile FSRbits_t FSRbits __at(0x004);
// bitfield macros
#define _FSR_FSR_POSN                                       0x0
#define _FSR_FSR_POSITION                                   0x0
#define _FSR_FSR_SIZE                                       0x8
#define _FSR_FSR_LENGTH                                     0x8
#define _FSR_FSR_MASK                                       0xFF

// Register: OSCCAL
#define OSCCAL OSCCAL
extern volatile unsigned char           OSCCAL              __at(0x005);
#ifndef _LIB_BUILD
asm("OSCCAL equ 05h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned CAL                    :7;
    };
    struct {
        unsigned                        :1;
        unsigned CAL0                   :1;
        unsigned CAL1                   :1;
        unsigned CAL2                   :1;
        unsigned CAL3                   :1;
        unsigned CAL4                   :1;
        unsigned CAL5                   :1;
        unsigned CAL6                   :1;
    };
} OSCCALbits_t;
extern volatile OSCCALbits_t OSCCALbits __at(0x005);
// bitfield macros
#define _OSCCAL_CAL_POSN                                    0x1
#define _OSCCAL_CAL_POSITION                                0x1
#define _OSCCAL_CAL_SIZE                                    0x7
#define _OSCCAL_CAL_LENGTH                                  0x7
#define _OSCCAL_CAL_MASK                                    0xFE
#define _OSCCAL_CAL0_POSN                                   0x1
#define _OSCCAL_CAL0_POSITION                               0x1
#define _OSCCAL_CAL0_SIZE                                   0x1
#define _OSCCAL_CAL0_LENGTH                                 0x1
#define _OSCCAL_CAL0_MASK                                   0x2
#define _OSCCAL_CAL1_POSN                                   0x2
#define _OSCCAL_CAL1_POSITION                               0x2
#define _OSCCAL_CAL1_SIZE                                   0x1
#define _OSCCAL_CAL1_LENGTH                                 0x1
#define _OSCCAL_CAL1_MASK                                   0x4
#define _OSCCAL_CAL2_POSN                                   0x3
#define _OSCCAL_CAL2_POSITION                               0x3
#define _OSCCAL_CAL2_SIZE                                   0x1
#define _OSCCAL_CAL2_LENGTH                                 0x1
#define _OSCCAL_CAL2_MASK                                   0x8
#define _OSCCAL_CAL3_POSN                                   0x4
#define _OSCCAL_CAL3_POSITION                               0x4
#define _OSCCAL_CAL3_SIZE                                   0x1
#define _OSCCAL_CAL3_LENGTH                                 0x1
#define _OSCCAL_CAL3_MASK                                   0x10
#define _OSCCAL_CAL4_POSN                                   0x5
#define _OSCCAL_CAL4_POSITION                               0x5
#define _OSCCAL_CAL4_SIZE                                   0x1
#define _OSCCAL_CAL4_LENGTH                                 0x1
#define _OSCCAL_CAL4_MASK                                   0x20
#define _OSCCAL_CAL5_POSN                                   0x6
#define _OSCCAL_CAL5_POSITION                               0x6
#define _OSCCAL_CAL5_SIZE                                   0x1
#define _OSCCAL_CAL5_LENGTH                                 0x1
#define _OSCCAL_CAL5_MASK                                   0x40
#define _OSCCAL_CAL6_POSN                                   0x7
#define _OSCCAL_CAL6_POSITION                               0x7
#define _OSCCAL_CAL6_SIZE                                   0x1
#define _OSCCAL_CAL6_LENGTH                                 0x1
#define _OSCCAL_CAL6_MASK                                   0x80

// Register: GPIO
#define GPIO GPIO
extern volatile unsigned char           GPIO                __at(0x006);
#ifndef _LIB_BUILD
asm("GPIO equ 06h");
#endif
// aliases
extern volatile unsigned char           PORTB               __at(0x006);
#ifndef _LIB_BUILD
asm("PORTB equ 06h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GP0                    :1;
        unsigned GP1                    :1;
        unsigned GP2                    :1;
        unsigned GP3                    :1;
        unsigned GP4                    :1;
        unsigned GP5                    :1;
    };
    struct {
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RB2                    :1;
        unsigned RB3                    :1;
        unsigned RB4                    :1;
        unsigned RB5                    :1;
    };
} GPIObits_t;
extern volatile GPIObits_t GPIObits __at(0x006);
// bitfield macros
#define _GPIO_GP0_POSN                                      0x0
#define _GPIO_GP0_POSITION                                  0x0
#define _GPIO_GP0_SIZE                                      0x1
#define _GPIO_GP0_LENGTH                                    0x1
#define _GPIO_GP0_MASK                                      0x1
#define _GPIO_GP1_POSN                                      0x1
#define _GPIO_GP1_POSITION                                  0x1
#define _GPIO_GP1_SIZE                                      0x1
#define _GPIO_GP1_LENGTH                                    0x1
#define _GPIO_GP1_MASK                                      0x2
#define _GPIO_GP2_POSN                                      0x2
#define _GPIO_GP2_POSITION                                  0x2
#define _GPIO_GP2_SIZE                                      0x1
#define _GPIO_GP2_LENGTH                                    0x1
#define _GPIO_GP2_MASK                                      0x4
#define _GPIO_GP3_POSN                                      0x3
#define _GPIO_GP3_POSITION                                  0x3
#define _GPIO_GP3_SIZE                                      0x1
#define _GPIO_GP3_LENGTH                                    0x1
#define _GPIO_GP3_MASK                                      0x8
#define _GPIO_GP4_POSN                                      0x4
#define _GPIO_GP4_POSITION                                  0x4
#define _GPIO_GP4_SIZE                                      0x1
#define _GPIO_GP4_LENGTH                                    0x1
#define _GPIO_GP4_MASK                                      0x10
#define _GPIO_GP5_POSN                                      0x5
#define _GPIO_GP5_POSITION                                  0x5
#define _GPIO_GP5_SIZE                                      0x1
#define _GPIO_GP5_LENGTH                                    0x1
#define _GPIO_GP5_MASK                                      0x20
#define _GPIO_RB0_POSN                                      0x0
#define _GPIO_RB0_POSITION                                  0x0
#define _GPIO_RB0_SIZE                                      0x1
#define _GPIO_RB0_LENGTH                                    0x1
#define _GPIO_RB0_MASK                                      0x1
#define _GPIO_RB1_POSN                                      0x1
#define _GPIO_RB1_POSITION                                  0x1
#define _GPIO_RB1_SIZE                                      0x1
#define _GPIO_RB1_LENGTH                                    0x1
#define _GPIO_RB1_MASK                                      0x2
#define _GPIO_RB2_POSN                                      0x2
#define _GPIO_RB2_POSITION                                  0x2
#define _GPIO_RB2_SIZE                                      0x1
#define _GPIO_RB2_LENGTH                                    0x1
#define _GPIO_RB2_MASK                                      0x4
#define _GPIO_RB3_POSN                                      0x3
#define _GPIO_RB3_POSITION                                  0x3
#define _GPIO_RB3_SIZE                                      0x1
#define _GPIO_RB3_LENGTH                                    0x1
#define _GPIO_RB3_MASK                                      0x8
#define _GPIO_RB4_POSN                                      0x4
#define _GPIO_RB4_POSITION                                  0x4
#define _GPIO_RB4_SIZE                                      0x1
#define _GPIO_RB4_LENGTH                                    0x1
#define _GPIO_RB4_MASK                                      0x10
#define _GPIO_RB5_POSN                                      0x5
#define _GPIO_RB5_POSITION                                  0x5
#define _GPIO_RB5_SIZE                                      0x1
#define _GPIO_RB5_LENGTH                                    0x1
#define _GPIO_RB5_MASK                                      0x20
// alias bitfield definitions
typedef union {
    struct {
        unsigned GP0                    :1;
        unsigned GP1                    :1;
        unsigned GP2                    :1;
        unsigned GP3                    :1;
        unsigned GP4                    :1;
        unsigned GP5                    :1;
    };
    struct {
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RB2                    :1;
        unsigned RB3                    :1;
        unsigned RB4                    :1;
        unsigned RB5                    :1;
    };
} PORTBbits_t;
extern volatile PORTBbits_t PORTBbits __at(0x006);
// bitfield macros
#define _PORTB_GP0_POSN                                     0x0
#define _PORTB_GP0_POSITION                                 0x0
#define _PORTB_GP0_SIZE                                     0x1
#define _PORTB_GP0_LENGTH                                   0x1
#define _PORTB_GP0_MASK                                     0x1
#define _PORTB_GP1_POSN                                     0x1
#define _PORTB_GP1_POSITION                                 0x1
#define _PORTB_GP1_SIZE                                     0x1
#define _PORTB_GP1_LENGTH                                   0x1
#define _PORTB_GP1_MASK                                     0x2
#define _PORTB_GP2_POSN                                     0x2
#define _PORTB_GP2_POSITION                                 0x2
#define _PORTB_GP2_SIZE                                     0x1
#define _PORTB_GP2_LENGTH                                   0x1
#define _PORTB_GP2_MASK                                     0x4
#define _PORTB_GP3_POSN                                     0x3
#define _PORTB_GP3_POSITION                                 0x3
#define _PORTB_GP3_SIZE                                     0x1
#define _PORTB_GP3_LENGTH                                   0x1
#define _PORTB_GP3_MASK                                     0x8
#define _PORTB_GP4_POSN                                     0x4
#define _PORTB_GP4_POSITION                                 0x4
#define _PORTB_GP4_SIZE                                     0x1
#define _PORTB_GP4_LENGTH                                   0x1
#define _PORTB_GP4_MASK                                     0x10
#define _PORTB_GP5_POSN                                     0x5
#define _PORTB_GP5_POSITION                                 0x5
#define _PORTB_GP5_SIZE                                     0x1
#define _PORTB_GP5_LENGTH                                   0x1
#define _PORTB_GP5_MASK                                     0x20
#define _PORTB_RB0_POSN                                     0x0
#define _PORTB_RB0_POSITION                                 0x0
#define _PORTB_RB0_SIZE                                     0x1
#define _PORTB_RB0_LENGTH                                   0x1
#define _PORTB_RB0_MASK                                     0x1
#define _PORTB_RB1_POSN                                     0x1
#define _PORTB_RB1_POSITION                                 0x1
#define _PORTB_RB1_SIZE                                     0x1
#define _PORTB_RB1_LENGTH                                   0x1
#define _PORTB_RB1_MASK                                     0x2
#define _PORTB_RB2_POSN                                     0x2
#define _PORTB_RB2_POSITION                                 0x2
#define _PORTB_RB2_SIZE                                     0x1
#define _PORTB_RB2_LENGTH                                   0x1
#define _PORTB_RB2_MASK                                     0x4
#define _PORTB_RB3_POSN                                     0x3
#define _PORTB_RB3_POSITION                                 0x3
#define _PORTB_RB3_SIZE                                     0x1
#define _PORTB_RB3_LENGTH                                   0x1
#define _PORTB_RB3_MASK                                     0x8
#define _PORTB_RB4_POSN                                     0x4
#define _PORTB_RB4_POSITION                                 0x4
#define _PORTB_RB4_SIZE                                     0x1
#define _PORTB_RB4_LENGTH                                   0x1
#define _PORTB_RB4_MASK                                     0x10
#define _PORTB_RB5_POSN                                     0x5
#define _PORTB_RB5_POSITION                                 0x5
#define _PORTB_RB5_SIZE                                     0x1
#define _PORTB_RB5_LENGTH                                   0x1
#define _PORTB_RB5_MASK                                     0x20

// Register: EECON
#define EECON EECON
extern volatile unsigned char           EECON               __at(0x021);
#ifndef _LIB_BUILD
asm("EECON equ 021h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD                     :1;
        unsigned WR                     :1;
        unsigned WREN                   :1;
        unsigned WRERR                  :1;
        unsigned FREE                   :1;
    };
} EECONbits_t;
extern volatile EECONbits_t EECONbits __at(0x021);
// bitfield macros
#define _EECON_RD_POSN                                      0x0
#define _EECON_RD_POSITION                                  0x0
#define _EECON_RD_SIZE                                      0x1
#define _EECON_RD_LENGTH                                    0x1
#define _EECON_RD_MASK                                      0x1
#define _EECON_WR_POSN                                      0x1
#define _EECON_WR_POSITION                                  0x1
#define _EECON_WR_SIZE                                      0x1
#define _EECON_WR_LENGTH                                    0x1
#define _EECON_WR_MASK                                      0x2
#define _EECON_WREN_POSN                                    0x2
#define _EECON_WREN_POSITION                                0x2
#define _EECON_WREN_SIZE                                    0x1
#define _EECON_WREN_LENGTH                                  0x1
#define _EECON_WREN_MASK                                    0x4
#define _EECON_WRERR_POSN                                   0x3
#define _EECON_WRERR_POSITION                               0x3
#define _EECON_WRERR_SIZE                                   0x1
#define _EECON_WRERR_LENGTH                                 0x1
#define _EECON_WRERR_MASK                                   0x8
#define _EECON_FREE_POSN                                    0x4
#define _EECON_FREE_POSITION                                0x4
#define _EECON_FREE_SIZE                                    0x1
#define _EECON_FREE_LENGTH                                  0x1
#define _EECON_FREE_MASK                                    0x10

// Register: EEDATA
#define EEDATA EEDATA
extern volatile unsigned char           EEDATA              __at(0x025);
#ifndef _LIB_BUILD
asm("EEDATA equ 025h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EEDATA                 :8;
    };
} EEDATAbits_t;
extern volatile EEDATAbits_t EEDATAbits __at(0x025);
// bitfield macros
#define _EEDATA_EEDATA_POSN                                 0x0
#define _EEDATA_EEDATA_POSITION                             0x0
#define _EEDATA_EEDATA_SIZE                                 0x8
#define _EEDATA_EEDATA_LENGTH                               0x8
#define _EEDATA_EEDATA_MASK                                 0xFF

// Register: EEADR
#define EEADR EEADR
extern volatile unsigned char           EEADR               __at(0x026);
#ifndef _LIB_BUILD
asm("EEADR equ 026h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EEADR                  :8;
    };
} EEADRbits_t;
